read_verilog   -sv output.v
synth -top VX_vortex_local_mem
dfflibmap -liberty mycells.lib
abc -liberty mycells.lib
clean
write_verilog synth.v
